24csu246

In [43]:
import pandas as pd
import numpy as np

Create a pandas Series my_series with the following data: [10, 20, 30, 40, 50]. The index
should be ['A', 'B', 'C', 'D', 'E']

In [44]:
series=[10,20,30,40,50]
my_series=pd.DataFrame(series,index=['A', 'B', 'C', 'D', 'E'])

In [45]:
my_series

    0
A  10
B  20
C  30
D  40
E  50

Print the values and index of my_series

In [46]:
print(my_series.index)

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [47]:
print(my_series.values)

[[10]
 [20]
 [30]
 [40]
 [50]]

Access and print the value at index 'C' in my_series

In [48]:
print(my_series.loc['C'])

0    30
Name: C, dtype: int64

In [49]:
my_series[my_series.index == 'C']

    0
C  30

Create a pandas DataFrame my_dataframe with the following data:
Name Age City
0 Alice 25 Paris
1 Bob 30 Tokyo
2 Claire 22 Rome
3 Dave 28 Oslo

In [50]:
name=['Alice', 'Bob', 'Claire', 'Dave']
age=[25, 30, 22, 28]
city=['Paris', 'Tokyo', 'Rome', 'Oslo']
d={'Name': name,'Age': age,'City':city }
my_dataframe=pd.DataFrame(d)

In [51]:
my_dataframe

     Name  Age   City
0   Alice   25  Paris
1     Bob   30  Tokyo
2  Claire   22   Rome
3    Dave   28   Oslo

Print the first two rows of `my_dataframe`

In [52]:
print(my_dataframe[0:2])

    Name  Age   City
0  Alice   25  Paris
1    Bob   30  Tokyo

Add a new row to `my_dataframe` with the data: ['Eva', 27, 'New York']

In [53]:
my_series=pd.concat([my_series,pd.Series(['Eva', 27, 'New York'],['F','G','H'])])

In [54]:
my_series

          0
A        10
B        20
C        30
D        40
E        50
F       Eva
G        27
H  New York

Access and print the 'Age' column of `my_dataframe`.

In [55]:
my_dataframe['Age']

0    25
1    30
2    22
3    28
Name: Age, dtype: int64

Mean of age

In [56]:
print("Mean of age is: ",my_dataframe['Age'].mean())

Mean of age is:  26.25

Filter `my_dataframe` to show only the rows where the age is greater than or equal to 25.

In [59]:
#for i in my_dataframe:

Name
Age
City

In [62]:
my_dataframe[my_dataframe['Age'] >=25]

    Name  Age   City
0  Alice   25  Paris
1    Bob   30  Tokyo
3   Dave   28   Oslo